docs/examples/Rate_v22/Rate  SmartPost Basic_Request_Reply.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v22">
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <ParentCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC062_SMART_POST with YourPackaging</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>22</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2016-12-12T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>SMART_POST</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <PreferredCurrency>USD</PreferredCurrency>
            <Shipper>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>sender@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>MEMPHIS</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38101</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>recipient@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>Collierville</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38017</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>Input Your Information</AccountNumber>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <SmartPostDetail>
               <Indicia>PARCEL_SELECT</Indicia>
               <AncillaryEndorsement>ADDRESS_CORRECTION</AncillaryEndorsement>
               <HubId>5751</HubId>
            </SmartPostDetail>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>6</Length>
                  <Width>4</Width>
                  <Height>1</Height>
                  <Units>IN</Units>
               </Dimensions>
               <CustomerReferences>
                  <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                  <Value>TC001_01_PT1_ST01_PK01_SNDUS_RCPCA_POS</Value>
               </CustomerReferences>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><RateReply xmlns="http://fedex.com/ws/rate/v22"><HighestSeverity>SUCCESS</HighestSeverity><Notifications><Severity>SUCCESS</Severity><Source>crs</Source><Code>0</Code><Message>Request was successfully processed. </Message><LocalizedMessage>Request was successfully processed. </LocalizedMessage></Notifications><TransactionDetail><CustomerTransactionId>TC062_SMART_POST with YourPackaging</CustomerTransactionId></TransactionDetail><Version><ServiceId>crs</ServiceId><Major>22</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RateReplyDetails><ServiceType>SMART_POST</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><IneligibleForMoneyBackGuarantee>false</IneligibleForMoneyBackGuarantee><SignatureOption>SERVICE_DEFAULT</SignatureOption><ActualRateType>PAYOR_ACCOUNT_PACKAGE</ActualRateType><RatedShipmentDetails><EffectiveNetDiscount><Currency>USD</Currency><Amount>7.3</Amount></EffectiveNetDiscount><ShipmentRateDetail><RateType>PAYOR_ACCOUNT_PACKAGE</RateType><RateZone>4</RateZone><RatedWeightMethod>ACTUAL</RatedWeightMethod><DimDivisor>0</DimDivisor><FuelSurchargePercent>8.0</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>20.0</Value></TotalBillingWeight><TotalBaseCharge><Currency>USD</Currency><Amount>10.28</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>1.95</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>8.33</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>0.67</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>9.0</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>9.0</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>9.0</Amount></TotalNetChargeWithDutiesAndTaxes><FreightDiscounts><RateDiscountType>VOLUME</RateDiscountType><Description>Base</Description><Amount><Currency>USD</Currency><Amount>0.51</Amount></Amount><Percent>5.0</Percent></FreightDiscounts><FreightDiscounts><RateDiscountType>VOLUME</RateDiscountType><Description>Matrix</Description><Amount><Currency>USD</Currency><Amount>1.03</Amount></Amount><Percent>10.0</Percent></FreightDiscounts><FreightDiscounts><RateDiscountType>EARNED</RateDiscountType><Description>Grace</Description><Amount><Currency>USD</Currency><Amount>0.41</Amount></Amount><Percent>4.0</Percent></FreightDiscounts><Surcharges><SurchargeType>FUEL</SurchargeType><Level>PACKAGE</Level><Description>SmartPost Fuel</Description><Amount><Currency>USD</Currency><Amount>0.67</Amount></Amount></Surcharges></ShipmentRateDetail><RatedPackages><GroupNumber>1</GroupNumber><EffectiveNetDiscount><Currency>USD</Currency><Amount>7.3</Amount></EffectiveNetDiscount><PackageRateDetail><RateType>PAYOR_ACCOUNT_PACKAGE</RateType><RatedWeightMethod>ACTUAL</RatedWeightMethod><BillingWeight><Units>LB</Units><Value>20.0</Value></BillingWeight><BaseCharge><Currency>USD</Currency><Amount>10.28</Amount></BaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>1.95</Amount></TotalFreightDiscounts><NetFreight><Currency>USD</Currency><Amount>8.33</Amount></NetFreight><TotalSurcharges><Currency>USD</Currency><Amount>0.67</Amount></TotalSurcharges><NetFedExCharge><Currency>USD</Currency><Amount>9.0</Amount></NetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><NetCharge><Currency>USD</Currency><Amount>9.0</Amount></NetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><FreightDiscounts><RateDiscountType>VOLUME</RateDiscountType><Description>Base</Description><Amount><Currency>USD</Currency><Amount>0.51</Amount></Amount><Percent>5.0</Percent></FreightDiscounts><FreightDiscounts><RateDiscountType>VOLUME</RateDiscountType><Description>Matrix</Description><Amount><Currency>USD</Currency><Amount>1.03</Amount></Amount><Percent>10.0</Percent></FreightDiscounts><FreightDiscounts><RateDiscountType>EARNED</RateDiscountType><Description>Grace</Description><Amount><Currency>USD</Currency><Amount>0.41</Amount></Amount><Percent>4.0</Percent></FreightDiscounts><Surcharges><SurchargeType>FUEL</SurchargeType><Level>PACKAGE</Level><Description>SmartPost Fuel</Description><Amount><Currency>USD</Currency><Amount>0.67</Amount></Amount></Surcharges></PackageRateDetail></RatedPackages></RatedShipmentDetails><RatedShipmentDetails><ShipmentRateDetail><RateType>PAYOR_LIST_PACKAGE</RateType><RateZone>2</RateZone><RatedWeightMethod>ACTUAL</RatedWeightMethod><DimDivisor>0</DimDivisor><FuelSurchargePercent>8.0</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>20.0</Value></TotalBillingWeight><TotalBaseCharge><Currency>USD</Currency><Amount>15.09</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>0.0</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>15.09</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>1.21</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>16.3</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>16.3</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>16.3</Amount></TotalNetChargeWithDutiesAndTaxes><Surcharges><SurchargeType>FUEL</SurchargeType><Level>PACKAGE</Level><Description>SmartPost Fuel</Description><Amount><Currency>USD</Currency><Amount>1.21</Amount></Amount></Surcharges></ShipmentRateDetail><RatedPackages><GroupNumber>1</GroupNumber><PackageRateDetail><RateType>PAYOR_LIST_PACKAGE</RateType><RatedWeightMethod>ACTUAL</RatedWeightMethod><BillingWeight><Units>LB</Units><Value>20.0</Value></BillingWeight><BaseCharge><Currency>USD</Currency><Amount>15.09</Amount></BaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>0.0</Amount></TotalFreightDiscounts><NetFreight><Currency>USD</Currency><Amount>15.09</Amount></NetFreight><TotalSurcharges><Currency>USD</Currency><Amount>1.21</Amount></TotalSurcharges><NetFedExCharge><Currency>USD</Currency><Amount>16.3</Amount></NetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><NetCharge><Currency>USD</Currency><Amount>16.3</Amount></NetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><Surcharges><SurchargeType>FUEL</SurchargeType><Level>PACKAGE</Level><Description>SmartPost Fuel</Description><Amount><Currency>USD</Currency><Amount>1.21</Amount></Amount></Surcharges></PackageRateDetail></RatedPackages></RatedShipmentDetails></RateReplyDetails></RateReply></SOAP-ENV:Body></SOAP-ENV:Envelope>